# SetDLComponentName

## Description
Sets the name of the component at index in the Double Line Preferences.

```pascal
FUNCTION SetDLComponentName(
				index         : INTEGER;
				componentName : STRING): BOOLEAN;
```

```python
def vs.SetDLComponentName(index, componentName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component.|
|componentName|STRING|The name of the component.|

## Remarks
CJG 3-23-07

## Examples
```pascal
resultOK := SetDLComponentName(1, 'Example');
```
```python
import vs

# Sets the name of the component at index in the Double Line Preferences.
index = 1
componentName = 'Example'

ok = vs.SetDLComponentName(index, componentName)
if ok:
    vs.Message('SetDLComponentName succeeded')
else:
    vs.Message('SetDLComponentName failed')
```

## See Also
VS Functions:
GetDLComponentName

## Version
Availability: from VectorWorks13.0

## Category
* Document Settings